# Kcal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Kcal Property
SymbolTypeId Class See Also
---
Symbol kcal, indicating unit Kilocalories.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Kcal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Kcal As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Kcal {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace